tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "local/rswift"
tap "romkatv/powerlevel10k"
tap "xcodesorg/made"
# Core application library for C
brew "glib"
# OpenType text shaping engine
brew "harfbuzz"
# Flexible lightweight test report tool
brew "allure"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Parser generator
brew "bison"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Command-line tool that allows to manage your resources with crowdin.com
brew "crowdin"
# Easiest way to build and release mobile apps
brew "fastlane"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Java-based scripting language
brew "groovy"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Improved top (interactive process viewer)
brew "htop"
# Extendable open source continuous integration server
brew "jenkins", restart_service: :changed
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library to render SVG files using Cairo
brew "librsvg"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Python dependency management tool
brew "pipenv"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.11", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Get strong typed, autocompleted resources like images, fonts and segues
brew "rswift"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Graphical command-line client for SSH
brew "sshs"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# XPath/XQuery 3.0, JSONiq interpreter to extract data from HTML/XML/JSON
brew "xidel"
# Get strong typed, autocompleted resources like images, fonts and segues
brew "local/rswift/rswift@6.1.0"
# Install and switch between multiple versions of Xcode
brew "xcodesorg/made/xcodes"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Driver for Chromium-based Opera releases
cask "operadriver"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Open-source version of the X.Org X Window System
cask "xquartz"
